hardcoreerik/esp-rtl-sdr/examples/p4_serial_smoke/sdkconfig.defaults
# CI / smoke defaults — ESP32-P4 High-Speed USB host path
CONFIG_IDF_TARGET="esp32p4"

# Leave headroom for USB host + C++ driver tasks
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000

# USB Host stack (P4)
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=1024

# Tab5 ships ESP32-P4 revision v1.3 (pre-v3 silicon). Images that require
# rev 3.1+ will refuse to flash.
CONFIG_ESP32P4_REV_MIN_0=y
